# Configuration
cask_args appdir: "/Applications"

# Fonts
cask "font-commit-mono-nerd-font"

# Utilities (Apps)
cask "aldente"
cask "appcleaner"
cask "imageoptim"
cask "jordanbaird-ice"
# cask "logi-options+" # TODO: Add back when it's fixed
cask "mos"
cask "nikitabobko/tap/aerospace"
cask "mediosz/tap/swipeaerospace"
cask "raycast"

# Utilities (CLI)
brew "chezmoi"
brew "displayplacer"
brew "imagemagick"
brew "mas"

# Shell tools (CLI)
brew "bat"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gnupg"
brew "ripgrep"
brew "rlwrap"
brew "unar"
brew "wget"

# Zsh plugins
brew "powerlevel10k"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Dev tools (Apps)
cask "bruno"
cask "codex"
cask "cursor"
cask "devtoys"
cask "iterm2"
cask "orbstack"
cask "screaming-frog-seo-spider"
cask "sublime-text"
cask "tableplus"
cask "xcodes-app"

# Dev tools (CLI)
brew "anomalyco/tap/opencode"
brew "gh"
brew "git"
brew "mise"

# Mobile development (Apps)
cask "android-studio"

# Mobile development (CLI)
brew "cocoapods"
brew "watchman"
# brew "fastlane"

{{ if .is_work_device }}
# PHP development (CLI)
brew "dnsmasq"
brew "httpd"
brew "imagemagick"
brew "libyaml"
brew "mariadb"
brew "openssl@3"
brew "shivammathur/php/php"
brew "shivammathur/php/php@7.0"
brew "shivammathur/php/php@7.1"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.3"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "shivammathur/php/php@8.1"
brew "shivammathur/php/php@8.2"
brew "shivammathur/php/php@8.3"
{{ end }}

# Design tools (Apps)
cask "canva"
cask "figma"

# Web browsers (Apps)
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# Productivity tools (Apps)
{{ if eq .chezmoi.arch "arm64" }}
cask "chatgpt"
{{ end }}
cask "google-drive"
cask "notion"
cask "raindropio"
cask "todoist-app"

# Communication tools (Apps)
cask "cameracontroller"
cask "discord"
{{ if .is_work_device }}
cask "mattermost"
cask "microsoft-teams"
{{ end }}

# Media (Apps)
cask "spotify"
cask "vlc"
{{ if .is_personal_device }}
brew "bandcamp-dl"
# cask "iptvnator"
cask "plex"
cask "transmission"
{{ end }}

# Mac App Store Applications
mas "Bitwarden", id: 1352778147
mas "TestFlight", id: 899247664
{{ if .is_personal_device }}
mas "iMovie", id: 408981434
mas "Zen IPTV", id: 6458223193
{{ end }}
{{ if .is_work_device }}
mas "Wireguard", id: 1451685025
{{ end }}

# VSCode / Cursor extensions
vscode "anysphere.cpptools"
vscode "EditorConfig.EditorConfig"
vscode "usernamehw.errorlens"
vscode "dbaeumer.vscode-eslint"
vscode "tamasfe.even-better-toml"
vscode "GitHub.github-vscode-theme"
vscode "eamodio.gitlens"
vscode "ritwickdey.LiveServer"
vscode "PKief.material-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "yoavbls.pretty-ts-errors"
vscode "alefragnani.project-manager"
vscode "anysphere.cursorpyright"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "anysphere.remote-ssh"
vscode "charliermarsh.ruff"
vscode "bradlc.vscode-tailwindcss"
vscode "meganrogge.template-string-converter"
vscode "Gruntfuggly.todo-tree"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-yaml"
